:PROPERTIES:
:ID:       7ec1d964-1255-4110-a14a-61ad913b00ae
:END:
#+TITLE: Emacs Forge: A few issues
#+CATEGORY: slips
#+TAGS:  

*** Forge =id= fields

These share the base64 encoding for =node_id= obtained from =github=

#+begin_src bash
repository_id='Z2l0aHViLmNvbTowMTA6UmVwb3NpdG9yeTE0MTM3ODE5NA=='
repository_forge_id='MDEwOlJlcG9zaXRvcnkxNDEzNzgxOTQ='

echo "$repository_id" | base64 --decode && echo
echo "$repository_forge_id" | base64 --decode && echo
#+end_src

#+RESULTS:
| github.com:010:Repository141378194 |
| 010:Repository141378194            |

*** Github GraphQL =node_id=

There's some kinda =base64= encoding for =node_id=, which is nice to know, since
=forge= SQL id's are similar

#+begin_src jq :in-file "/tmp/tmp.K0tUua2GmR/gh-pulls-for-repo.json"
. as $data
  | [ path(..| select(objects) | select(has("node_id"))) ]
  | map(. += ["node_id"])
  | map({ (.|join(".")): (. as $path | .=$data | getpath($path) | @base64d) })
#+end_src

#+RESULTS:
#+begin_example
[
  {
    "0.node_id": "011:PullRequest1"
  },
  {
    "0.user.node_id": "04:User1"
  },
  {
    "0.labels.0.node_id": "05:Label208045946"
  },
  {
    "0.milestone.node_id": "09:Milestone1002604"
  },
  {
    "0.milestone.creator.node_id": "04:User1"
  },
  {
    "0.assignee.node_id": "04:User1"
  },
  {
    "0.assignees.0.node_id": "04:User1"
  },
  {
    "0.assignees.1.node_id": "04:User1"
  },
  {
    "0.requested_reviewers.0.node_id": "04:User1"
  },
  {
    "0.requested_teams.0.node_id": "04:Team1"
  },
  {
    "0.head.user.node_id": "04:User1"
  },
  {
    "0.head.repo.node_id": "010:Repository1296269"
  },
  {
    "0.head.repo.owner.node_id": "04:User1"
  },
  {
    "0.head.repo.license.node_id": "07:Licensemit"
  },
  {
    "0.base.user.node_id": "04:User1"
  },
  {
    "0.base.repo.node_id": "010:Repository1296269"
  },
  {
    "0.base.repo.owner.node_id": "04:User1"
  },
  {
    "0.base.repo.license.node_id": "07:Licensemit"
  }
]
#+end_example

*** Issues

Test =jq= on =repos/:gh-org/:gh-repo/issues?sort=created= results

#+begin_src jq :in-file "/tmp/tmp.K0tUua2GmR/gh-issues-for-repo.json"
sort_by(.created_at) | map([ (.repository_url | split("/") | .[-2]),
      (.repository_url | split("/") | .[-1]),
      .number,
      .created_at,
      .updated_at,
      .closed_at ])
#+end_src

#+RESULTS:
#+begin_example
[
  [
    "octocat",
    "Hello-World",
    1347,
    "2011-04-22T13:33:48Z",
    "2011-04-22T13:33:48Z",
    null
  ]
]
#+end_example

#+name: forgeIssuesFor
#+headers: :jq-args "--raw-output" :eval query :results table
#+begin_src restclient :jq "sort_by(.created_at) | map([ (.repository_url | split(\"/\") | .[-2]), (.repository_url | split(\"/\") | .[-1]), .number, .created_at, .updated_at, .closed_at ])[] | @csv"
:gh-graphql-url = https://api.github.com/graphql
:gh-url-base = https://api.github.com
:gh-url-path = repos/:gh-org/:gh-repo/issues
:gh-token := (auth-source-pass-get 'secret "api.github.com/dcunited001^ghub")

:headers = <<
Accept: application/vnd.github+json
Authorization: Bearer :gh-token
X-GitHub-Api-Version: 2022-11-28
User-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:138.0) Gecko/20100101 Firefox/138.0
# terminating with a comment is necessary

GET :gh-url-base/:gh-url-path?sort=created
:headers
#+end_src

#+RESULTS: forgeIssuesFor
| basecamp | omarchy | 3882 | 2025-12-15T16:18:10Z | 2025-12-18T22:29:44Z |   |
| basecamp | omarchy | 3883 | 2025-12-15T17:25:44Z | 2025-12-15T21:13:53Z |   |
| basecamp | omarchy | 3891 | 2025-12-16T07:01:07Z | 2025-12-18T14:15:11Z |   |
| basecamp | omarchy | 3893 | 2025-12-16T09:48:43Z | 2025-12-16T12:34:32Z |   |
| basecamp | omarchy | 3898 | 2025-12-16T13:26:40Z | 2025-12-20T10:16:51Z |   |
| basecamp | omarchy | 3899 | 2025-12-16T13:39:31Z | 2025-12-21T19:24:15Z |   |
| basecamp | omarchy | 3900 | 2025-12-16T16:28:34Z | 2025-12-21T16:07:59Z |   |
| basecamp | omarchy | 3906 | 2025-12-16T18:44:41Z | 2025-12-16T19:00:25Z |   |
| basecamp | omarchy | 3908 | 2025-12-16T19:58:41Z | 2025-12-16T19:58:41Z |   |
| basecamp | omarchy | 3912 | 2025-12-17T01:13:18Z | 2025-12-20T03:46:30Z |   |
| basecamp | omarchy | 3914 | 2025-12-17T08:32:40Z | 2025-12-17T18:47:07Z |   |
| basecamp | omarchy | 3915 | 2025-12-17T10:01:09Z | 2025-12-17T11:07:55Z |   |
| basecamp | omarchy | 3916 | 2025-12-17T11:19:39Z | 2025-12-17T11:19:39Z |   |
| basecamp | omarchy | 3917 | 2025-12-17T13:42:50Z | 2025-12-21T15:37:41Z |   |
| basecamp | omarchy | 3918 | 2025-12-17T14:38:40Z | 2025-12-19T09:06:09Z |   |
| basecamp | omarchy | 3921 | 2025-12-17T18:48:29Z | 2025-12-17T18:48:29Z |   |
| basecamp | omarchy | 3924 | 2025-12-17T21:24:21Z | 2025-12-20T22:16:49Z |   |
| basecamp | omarchy | 3926 | 2025-12-17T23:45:04Z | 2025-12-18T22:01:25Z |   |
| basecamp | omarchy | 3930 | 2025-12-18T04:43:43Z | 2025-12-18T15:53:06Z |   |
| basecamp | omarchy | 3936 | 2025-12-18T16:19:29Z | 2025-12-18T22:49:03Z |   |
| basecamp | omarchy | 3938 | 2025-12-18T17:23:50Z | 2025-12-18T17:23:50Z |   |
| basecamp | omarchy | 3941 | 2025-12-19T12:55:46Z | 2025-12-19T12:58:23Z |   |
| basecamp | omarchy | 3942 | 2025-12-19T15:24:25Z | 2025-12-19T15:24:25Z |   |
| basecamp | omarchy | 3945 | 2025-12-19T19:25:26Z | 2025-12-21T19:05:02Z |   |
| basecamp | omarchy | 3947 | 2025-12-20T03:34:13Z | 2025-12-20T13:57:40Z |   |
| basecamp | omarchy | 3948 | 2025-12-20T04:03:34Z | 2025-12-20T04:16:46Z |   |
| basecamp | omarchy | 3954 | 2025-12-21T10:51:04Z | 2025-12-21T10:54:53Z |   |
| basecamp | omarchy | 3955 | 2025-12-21T15:33:32Z | 2025-12-21T16:42:25Z |   |
| basecamp | omarchy | 3956 | 2025-12-21T16:27:55Z | 2025-12-21T16:35:53Z |   |
| basecamp | omarchy | 3957 | 2025-12-21T17:29:13Z | 2025-12-21T20:16:56Z |   |

*** Pull Requests

Test =jq= on =repos/:gh-org/:gh-repo/pulls?sort=created= results

#+begin_src jq :in-file "/tmp/tmp.K0tUua2GmR/gh-pulls-for-repo.json"
sort_by(.created_at) |
  map([ (.html_url | split("/") | .[-4]),
        (.html_url | split("/") | .[-3]),
        .number,
        .created_at,
        .updated_at,
      .closed_at ])
#+end_src

#+RESULTS:
#+begin_example
[
  [
    "octocat",
    "Hello-World",
    1347,
    "2011-01-26T19:01:12Z",
    "2011-01-26T19:01:12Z",
    "2011-01-26T19:01:12Z"
  ]
]
#+end_example

#+name: forgePullsFor
#+headers: :jq-args "--raw-output" :eval query :results table
#+begin_src restclient :jq "."
# "sort_by(.created_at) | map([ (.html_url | split(\"/\") | .[-4]), (.html_url | split(\"/\") | .[-3]), .number, .created_at, .updated_at, .closed_at ])[] | @csv"
:gh-graphql-url = https://api.github.com/graphql
:gh-url-base = https://api.github.com
:gh-url-path = repos/:gh-org/:gh-repo
:gh-token := (auth-source-pass-get 'secret "api.github.com/dcunited001^ghub")

:headers = <<
Accept: application/vnd.github+json
Authorization: Bearer :gh-token
X-GitHub-Api-Version: 2022-11-28
User-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:138.0) Gecko/20100101 Firefox/138.0
# terminating with a comment is necessary

GET :gh-url-base/:gh-url-path/pulls?sort=created&direction=desc
:headers
#+end_src

#+RESULTS: forgePullsFor
| jq: parse error: Invalid escape at line 9470 | column 2513 |

